docs/addDemographicSoapRequest3.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.oscarehr.org/">
   <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:Username>129</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Dgi48a7p</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <ws:addDemographic>
          <arg0>
         <activeCount>1</activeCount>
         <dateOfBirth>05</dateOfBirth>
         <displayName>displayname 2345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</displayName>
         <firstName>first name 12345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</firstName>
         <hin>9781468294</hin>
         <hsAlertCount>0</hsAlertCount>
         <hcType>ON</hcType>
         <lastName>BCst name 112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</lastName>
         <monthOfBirth>05</monthOfBirth>
         <sex>M</sex>
         <sexDesc>Femle56789012345678901234567890123456789012345678901234567890</sexDesc>
         <ver>WV</ver>
         <yearOfBirth>1964</yearOfBirth>
         <address>address    12345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</address>
         <city>city       12345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</city>

            <effDate>1901-01-01</effDate>
            <email>1234567890@123456789.123456783123456789412345678951234567896123456789712345678981234567899123456789012345678911234567890</email>
            <endDate>2016-10-01</endDate>
            <familyDoctor>0123456789112345678921234567893123456789412345678951234567896</familyDoctor>
            <hcRenewDate>2016-10-01</hcRenewDate><headRecord>1</headRecord><hin>9781468292</hin><hsAlertCount>3</hsAlertCount>
            <officialLanguage>official language 8921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</officialLanguage>
            <patientStatus>0123456789012345678901234567890123456789012345678901234567890</patientStatus>
            <patientStatusDate>2016-10-01</patientStatusDate>
            <pcnIndicator>a</pcnIndicator>
            <phone>phone 6789012345678901234567890</phone>
            <phone2>01234567889012345678901234567890</phone2><postal>N1G 1H9</postal>
            <previousAddress>previous address  8921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</previousAddress>
            <province>ON</province>
            <rosterDate>2016-10-01</rosterDate>
            <rosterStatus>1</rosterStatus>
            <rosterTerminationDate>2016-10-01</rosterTerminationDate>
            <rosterTerminationReason>reason</rosterTerminationReason>
            <sex>M</sex>
            <sin>467825642</sin>
            <sourceOfIncome>lottery</sourceOfIncome>
            <spokenLanguage>spoken language   8921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</spokenLanguage>
            <title>title      12345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-100-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-200-5678911234567892123456789312345678941234567895123456789612345678971234567898123456789912345678901234567891123456789212345678931234567894123456789512345678961234567897123456789812345678991234567890123456789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789-300-56789112345678921234567893123456789412345678951234567896123456789712345678981234567899123456789</title>
            <ver>1</ver>

          </arg0>

      </ws:addDemographic>
   </soapenv:Body>
</soapenv:Envelope>





